本次降权操作时长为永久
案例1，本月有浏览，有降权 浏览1次*0.05 浏览两次*0 （目标：不干扰正常降权）
案例2 本月无浏览（可以为当前时间窗口内无浏览，或者永久无浏览），有降权（badcase，目标为浏览偏好中，无论几次，用户偏好为0）




希德设备不感兴趣
select * from user_dislike_content where device_id='hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==';
116     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7329039 显卡         8.0      2017-06-01 15:51:56.0   1
117     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7325940 机箱         8.0      2017-06-01 15:51:59.0   1
118     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7323843 键盘         8.0      2017-06-01 15:52:02.0   1
119     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7329249 显示器       8.0      2017-06-01 15:52:07.0   1
120     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7323700 显示器       8.0      2017-06-01 15:52:15.0   1
121     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7324333 主板         8.0      2017-06-01 15:53:33.0   1
122     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7323701 显示器       8.0      2017-06-01 15:53:35.0   1
123     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7328284 显示器       8.0      2017-06-01 15:53:39.0   1
124     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7327469 显示器       8.0      2017-06-01 15:53:42.0   1
125     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7324166 显卡         8.0      2017-06-01 15:53:53.0   1
126     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7325993 NAS存储      8.0      2017-06-01 15:53:57.0   1
127     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7328868              2017618数码3C    8.0     2017-06-01 15:54:26.0   1
128     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7328644              2017618数码3C    8.0     2017-06-01 15:54:32.0   1
129     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7322568              2017618数码3C    8.0     2017-06-01 15:54:42.0   1
130     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7326146              2017618数码3C    8.0     2017-06-01 15:54:48.0   1
131     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7326063              2017618数码3C    8.0     2017-06-01 15:54:56.0   1
133     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7324094 主板         8.0      2017-06-01 16:14:34.0   1
134     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7326109 机箱         2017618数码3C    8.0     2017-06-01 16:14:50.0   1
135     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7326249 家用电脑     2017618数码3C    8.0     2017-06-01 16:15:10.0   1
136     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7324112 显卡         2017618数码3C    8.0     2017-06-01 16:15:34.0   1
137     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7328509 超极本       2017618数码3C    8.0     2017-06-01 16:16:01.0   1
138     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7328259 CPU          2017618数码3C    8.0     2017-06-01 16:16:15.0   1
139     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7328114 电脑数码     AMD      2017618数码3C   8.0     2017-06-01 16:16:20.0   1
140     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7323614 电脑电源     2017618数码3C    8.0     2017-06-01 16:16:26.0   1
141     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7323610 鼠标         2017618数码3C    8.0     2017-06-01 16:16:32.0   1
142     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7327668 游戏本       2017618数码3C    8.0     2017-06-01 16:16:38.0   1
143     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7328149 显示器       2017618数码3C    8.0     2017-06-01 16:17:48.0   1
144     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7323936 显示器       2017618数码3C    8.0     2017-06-01 16:19:21.0   1
145     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7323965 显卡         2017618数码3C    8.0     2017-06-01 16:19:25.0   1
146     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                11      565748  鼠标         8.0      2017-06-01 16:19:45.0   1
147     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7323682 游戏耳机     2017618数码3C    8.0     2017-06-01 16:19:57.0   1
148     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7324033 显示器       2017618数码3C    8.0     2017-06-01 16:20:22.0   1
149     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7328166 显示器       2017618数码3C    8.0     2017-06-01 16:21:02.0   1
150     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7323752 机箱         2017618数码3C    8.0     2017-06-01 16:21:07.0   1
151     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7326593 其它电脑配件 2017618数码3C    8.0     2017-06-01 16:27:42.0   1
152     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7324131 显示器       2017618数码3C,61显示器   8.0     2017-06-01 16:28:07.0   1
153     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7324064 主板         2017618数码3C    8.0     2017-06-01 16:28:25.0   1
154     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7323617 NAS存储      2017618数码3C    8.0     2017-06-01 16:28:58.0   1
155     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7326046 CPU散热器    2017618数码3C    8.0     2017-06-01 16:29:29.0   1
273     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7383659历史低价        8.0     2017-06-12 14:09:46.0   1
274     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7383659历史低价        8.0     2017-06-12 14:10:24.0   1
336     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7449794              8.0.1    2017-06-23 16:51:00.0   1
337     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7449764 面霜         8.0.1    2017-06-23 16:52:34.0   1
338     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7450169 童车童床     8.0.1    2017-06-23 16:55:36.0   1
367     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7450953              8.0.1    2017-06-24 00:14:22.0   1
368     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                5       7448489 面膜面贴     la prairie               8.0.1   2017-06-24 00:14:30.0   1
464     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7462556              8.0.1    2017-06-27 14:02:04.0   1
935     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7500598 空调         8.1.0.1  2017-07-06 17:12:19.0   1
936     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7500720 剃须除毛     8.1.0.1  2017-07-06 17:12:22.0   1
937     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                5       7500607 男士休闲鞋   8.1.0.1  2017-07-06 17:12:27.0   1
938     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7500775         Panasonic/松下                8.1.0.1 2017-07-06 17:12:30.0   1
939     hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7500043         Panasonic/松下                8.1.0.1 2017-07-06 17:13:18.0   1
1289    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7521211         CORSAIR/美商海盗船            8.1.0.8 2017-07-11 17:56:04.0   1
1290    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                5       7520955 电脑数码     8.1.0.8  2017-07-11 17:56:09.0   1
1291    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7521411         HP/惠普              8.1.0.8 2017-07-11 17:56:12.0   1
1292    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7521241         HP/惠普              8.1.0.8 2017-07-11 17:56:17.0   1
1293    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                5       7520169贝窝    8.1.0.8 2017-07-11 17:56:22.0   1
1294    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                5       7521323 耳机         8.1.0.8  2017-07-11 17:56:32.0   1
1295    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7520974 手机耳机     8.1.0.8  2017-07-11 17:56:37.0   1
1296    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7521344 五金工具     8.1.0.8  2017-07-11 17:56:45.0   1
1297    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7520774 吸顶灯       8.1.0.8  2017-07-11 17:56:48.0   1
1298    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7521125         Shinelon/炫龙         8.1.0.8 2017-07-11 17:57:05.0   1
1299    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7521190 手机耳机     8.1.0.8  2017-07-11 17:57:16.0   1
1401    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7528006   历史低价        8.1.0.10        2017-07-13 11:11:57.0   1
1492    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7535115 少儿读物     8.1.0.12 2017-07-14 23:31:20.0   1
1493    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                5       7535435 女士手提包   8.1.0.12 2017-07-14 23:31:27.0   1
1494    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7535177 男士商务鞋   ROCKPORT/乐步            8.1.0.12        2017-07-14 23:34:09.0   1
1495    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7530217 女包         8.1.0.12 2017-07-14 23:34:17.0   1
1496    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                6       32604                8.1.0.12 2017-07-14 23:34:37.0   1
1497    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7533688 男靴         8.1.0.12 2017-07-14 23:35:14.0   1
1498    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7533805 男靴         8.1.0.12 2017-07-14 23:36:00.0   1
1499    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7532818 女士手提包   8.1.0.12 2017-07-14 23:36:10.0   1
1500    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7534958 太阳镜       8.1.0.12 2017-07-14 23:36:52.0   1
1501    hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==                1       7534830 太阳镜       8.1.0.12 2017-07-14 23:36:59.0   1
Time taken: 0.036 seconds, Fetched: 74 row(s)

select b.tag_id,b.tag_standar,b.tag_standar_new,a.name from smzdm_tag_type a right join youhui_dislike_tag b  on a.id=b.tag_id where b.device_id='hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==' and b.ds='20170813';

贝窝*1(本月有浏览) 历史低价*2(本月有浏览) 2017618数码3C*5（本月无浏览）
 261839  0.037   0.037   值友专享
 421605  0.1296  0.1296  718笔记本
 （降权数据）223871  0.1667  0.008335        贝窝
 415904  0.0185  0.0185  开春户外
 418264  1.0     1.0     国内凑单品
 403137  0.0926  0.0926  19块9包邮
 388447  0.1481  0.1481  英国馆
 64211   0.037   0.037   9块9包邮
 388351  0.037   0.037   美国馆
 418380  0.037   0.037   拼单
 418264  0.1852  0.1852  国内凑单品
 421140  0.0185  0.0185  全球PrimeDay食品家居
 411808  0.0185  0.0185  车榜单
 381538  0.0185  0.0185  移动专享
 322337  0.5926  0.5926  每日白菜
 406493  0.0185  0.0185  中亚Prime会员
 （插入数据）418908  0.0     0.0     2017618数码3C
 380411  0.0185  0.0185  白菜凑单
 337871  0.0185  0.0185  临期品
 322337  0.0741  0.0741  每日白菜
 418380  0.463   0.463   拼单
 397801  0.1667  0.1667  一键海淘
 404251  0.2593  0.2593  小吃货
 116853  0.1111  0.1111  七夕
 60751   0.0741  0.0741  天猫白菜
 415903  0.7593  0.7593  零食囤货
 418018  0.037   0.037   淘金v计划
 39467   0.0926  0.0926  历史新低
 391333  0.0185  0.0185  618专题家居生活
 403137  0.037   0.037   19块9包邮
 416734  0.037   0.037   新品发售
 39467   0.037   0.037   历史新低
（降权数据）14995   0.037   0.0     历史低价
 422520  0.037   0.037   驭帅11
 62445   0.0185  0.0185  全合成机油
 421699  0.0185  0.0185  杉果夏促
 396339  0.037   0.037   新品首降
 420876  0.0185  0.0185  全球PrimeDay
 60753   0.037   0.037   白菜包邮
 416513  0.0556  0.0556  京东PLUS会员
 416734  0.0741  0.0741  新品发售
 416516  0.0926  0.0926  养车囤货
 404253  0.0556  0.0556  运动派
 60751   0.1111  0.1111  天猫白菜
（插入数据）223871  0.1667  0.1667  贝窝
（插入数据）14995   0.037   0.037   历史低价



最终输出结果
select * from device_redis where device_id='hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==';
hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==        27:0.0682#0.0,57:0.0455#0.0,75:0.0455#0.0,95:0.5#1.0,147:0.2273#0.24133036953549775,93:0.0227#0.0,163:0.0#0.9719319191808508,1515:0.1667#0.0,191:0.0682#0.0|27:0.0682,57:0.0455,75:0.0455,95:0.5,147:0.2273,93:0.0227,163:0.0,1515:0.1667,191:0.0682|1049:0.0,453:0.0,285:0.0,3347:0.0,3365:0.0,1047:0.0,3333:0.0,3739:0.0,5287:1.0,853:0.3333,1163:0.0,261:0.3333,3639:0.0,5051:0.0,667:0.0,3391:1.0,575:0.0,87:0.0,1057:0.0,1219:0.0,2911:0.3333,1257:0.0,4885:0.0,1315:0.0,3377:0.0,3403:0.0_1047:0.0,163:0.0,2091:0.5,2451:0.25,3333:0.0,3423:0.5,3739:0.0,389:0.25,1257:0.0,2373:1.0,3967:1.0,4885:0.0,1331:1.0,2123:1.0,1057:0.0,1219:0.0,1255:0.25,1141:0.5,1259:0.25,285:0.0,3347:0.0,3365:0.0,133:0.0,5437:0.25,575:0.0,87:0.0,1163:0.0,3639:0.0,3945:1.0,397:0.25,4287:1.0,5051:0.0,5358:0.5,667:0.0,1049:0.0,453:0.0,2121:1.0,455:1.0,5353:0.5,1261:1.0,1315:0.0,3377:0.0,3403:0.0,413:0.25,4835:1.0,5357:0.5   1931:0.1429,273:0.2857,4217:0.1429,42736:0.1429,44941:0.1429,5441:0.1429,55:0.5714,13145:0.1429,167:0.1429,1681:0.5714,17529:0.1429,1933:0.4286,1951:0.007145,21849:0.1429,2725:0.1429,27951:0.1429,34863:0.1429,671:0.1429,707:0.1429,13833:0.1429,1685:0.1429,18531:0.1429,20105:0.1429,23553:0.1429,2495:0.1429,2701:0.4286,42895:0.1429,6059:0.1429,11553:0.1429,159:0.1429,16341:0.1429,1673:0.0,1925:0.1429,249:0.1429,28627:0.007145,4085:0.1429,49:0.2857,151:0.1429,1675:0.1429,1701:0.0,2485:0.1429,269:0.2857,42416:0.1429,7949:0.1429,1433:0.1429,1677:0.1429,16921:0.1429,1695:0.1429,3341:0.1429,12963:0.1429,30837:0.1429,36174:0.2857,36796:0.1429,6269:0.1429,731:0.1429,9095:0.1429,1205:0.1429,1683:0.2857,1773:0.2857,6011:0.1429,763:0.1429,7849:0.2857,1353:0.1429,1669:0.1429,16823:0.1429,1687:1.0,17921:0.1429,20099:0.1429,2857:0.1429,42121:0.1429,13225:0.1429,1743:0.0,21127:0.1429,247:0.0,41233:0.1429,43268:0.1429,805:0.1429_20217:0.5,309:0.5,1933:1.0,257:0.5,1829:0.5,41808:1.0,1167:0.5,247:1.0,249:1.0    39467:0.037,421699:0.0185,60751:0.0741,116853:0.1111,388447:0.1481,418380:0.037,380411:0.0185,420876:0.0185,14995:0.0,322337:0.0741,416513:0.0556,418908:0.0,381538:0.0185,388351:0.037,397801:0.1667,403137:0.037,404253:0.0556,421605:0.1296,391333:0.0185,411808:0.0185,415903:0.7593,418018:0.037,421140:0.0185,223871:0.008335,396339:0.037,415904:0.0185,416516:0.0926,60753:0.037,62445:0.0185,416734:0.037,418264:0.1852,422520:0.037,404251:0.2593,406493:0.0185,64211:0.037,261839:0.037,337871:0.0185_159927:1.0,302477:0.5,421266:1.0,78121:1.0,218897:1.0,302479:0.5,416031:0.5,25837:1.0,419021:1.0,416027:1.0,302481:0.5


有浏览 Shinelon/炫龙  ROCKPORT/乐步
无浏览 AMD
select b.brand_id,b.brand_level_standar,b.brand_level_standar_new,a.associate_title from sync_smzdm_brand a right join youhui_dislike_brand b  on a.id=b.brand_id where b.device_id='hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==' and b.ds='20170813';
30837   0.1429  0.1429  So Natural
1677    0.1429  0.1429  ALIENWARE/外星人
4217    0.1429  0.1429  OCEAN FAMILY/大洋世家
21127   0.1429  0.1429  Swisse/瑞思
167     0.1429  0.1429  黄飞红
707     0.1429  0.1429  Ganen/感恩
2857    0.1429  0.1429  La Tourangelle
1681    0.5714  0.5714  ASUS/华硕
42895   0.1429  0.1429  LAO JIE KOU/老街口
1951    0.1429  0.007145        ROCKPORT/乐步
9095    0.1429  0.1429  楼兰蜜语
1685    0.1429  0.1429  msi/微星
805     0.1429  0.1429  ARCERYX/始祖鸟
1205    0.1429  0.1429  COACH/蔻驰
4085    0.1429  0.1429  KAM YUEN/甘源牌
1925    0.1429  0.1429  OPPO/欧珀
2485    0.1429  0.1429  OREO/奥利奥
13225   0.1429  0.1429  皇上皇
2725    0.1429  0.1429  ThundeRobot/雷神
2495    0.1429  0.1429  nubia/努比亚
20105   0.1429  0.1429  TG/探戈
13145   0.1429  0.1429  来伊份
1675    0.1429  0.1429  DELL/戴尔
1695    0.1429  0.1429  GIGABYTE/技嘉
28627   0.1429  0.007145        Shinelon/炫龙
3341    0.1429  0.1429  Silang/思朗
151     0.1429  0.1429  Matsunaga/松永
17921   0.1429  0.1429  MIAOW MIAOW
5441    0.1429  0.1429  Better/巧贝特
16921   0.1429  0.1429  OnePlus/一加
671     0.1429  0.1429  Cybex/赛百适
6011    0.1429  0.1429  Danesita/丹妮丝塔
18531   0.1429  0.1429  smartisan/锤子科技
16341   0.1429  0.1429  嘉友
731     0.1429  0.1429  LI-NING/李宁
1931    0.1429  0.1429  MEIZU/魅族
42121   0.1429  0.1429  和厨
27951   0.1429  0.1429  LIRAY/粮悦
44941   0.1429  0.1429  奢雨
1701    0.0     0.0     AMD
1951    0.1429  0.1429  ROCKPORT/乐步
1773    0.2857  0.2857  Logitech/罗技
273     0.2857  0.2857  PHILIPS/飞利浦
1683    0.2857  0.2857  Hasee/神舟
11553   0.1429  0.1429  佳宝
23553   0.1429  0.1429  西域美农
12963   0.1429  0.1429  AFTERSHOKZ
16823   0.1429  0.1429  FOREO
763     0.1429  0.1429  PUMA/彪马
1353    0.1429  0.1429  crocs/卡骆驰
1433    0.1429  0.1429  Mobil/美孚
13833   0.1429  0.1429  ChaCheer/洽洽
34863   0.1429  0.1429  Yokohama/优科豪马
41233   0.1429  0.1429  Msvii/摩斯维
36174   0.2857  0.2857  好牌
1687    1.0     1.0     Apple/苹果
43268   0.1429  0.1429  沃隆
36796   0.1429  0.1429  TK FOOD/老杨
42736   0.1429  0.1429  Yummy Palace/俏香阁
42416   0.1429  0.1429  心韵
1673    0.0     0.0     HP/惠普
1743    0.0     0.0     CORSAIR/美商海盗船
2701    0.4286  0.4286  Lays/乐事
17529   0.1429  0.1429  MACHENIKE/机械师
249     0.1429  0.1429  SONY/索尼
159     0.1429  0.1429  徐福记
21849   0.1429  0.1429  盯盯拍
6059    0.1429  0.1429  奇虎360
1669    0.1429  0.1429  Lenovo/联想
6269    0.1429  0.1429  CRICH/克里奇
7949    0.1429  0.1429  HAMU/哈姆
20099   0.1429  0.1429  BRIDGESTONE/普利司通
55      0.5714  0.5714  MENGNIU/蒙牛
269     0.2857  0.2857  Haier/海尔
49      0.2857  0.2857  康师傅
7849    0.2857  0.2857  正林
1933    0.4286  0.4286  MI/小米
247     0.0     0.0     Panasonic/松下
28627   0.1429  0.1429  Shinelon/炫龙




select b.level_id,b.level_standar,b.level_standar_new,a.level from level_map a right join youhui_dislike_level b  on a.level_id=b.level_id where b.device_id='hy4K6471h/LVi3ng1VjYa6RWzp511qG9iz1AyKCT8JzFnWwHJ7hiwg==' and b.ds='20170813';
2911    0.3333  0.3333  冲调饮品
57      0.0455  0.0455  服饰鞋包
75      0.0455  0.0455  母婴用品
147     0.2273  0.2273  汽车消费
1163    0.0     0.0     五金工具
453     0.0     0.0     耳机
285     0.0     0.0     超极本
4885    0.0     0.0     游戏本
3639    0.0     0.0     太阳镜
3403    0.0     0.0     游戏耳机
5051    0.0     0.0     CPU散热器
575     0.0     0.0     女士手提包
667     0.0     0.0     面膜面贴
3377    0.0     0.0     NAS存储
163     0.8409  0.8409  电脑数码
1047    0.0     0.0     男士商务鞋
1257    0.0     0.0     空调
87      0.0     0.0     童车童床
1057    0.3333  0.0     男靴
163     1.0     0.0     电脑数码
853     0.3333  0.3333  新鲜水果
191     0.0682  0.0682  运动户外
3391    1.0     1.0     键鼠
261     0.3333  0.3333  篮球鞋
5287    1.0     1.0     男士短靴
113     0.0455  0.0455  个护化妆
163     0.8409  0.0     电脑数码
93      0.0227  0.0227  玩模乐器
27      0.0682  0.0682  家用电器
1515    0.1667  0.1667  日用百货
95      1.0     1.0     食品保健
95      0.5     0.5     食品保健
95      1.0     1.0     食品保健
1315    0.0     0.0     剃须除毛
3365    0.0     0.0     其它电脑配件
163     1.0     1.0     电脑数码
1057    0.3333  0.3333  男靴
3347    0.0     0.0     家用电脑
1049    0.0     0.0     男士休闲鞋
1219    0.0     0.0     吸顶灯
133     0.0     0.0     女包
3333    0.0     0.0     手机耳机
3739    0.0     0.0     面霜
